content/a-mini-panic.org
#+TITLE: A Mini Panic
#+AUTHOR: shrirambo
#+DATE:  [2022-08-05]
#+OPTIONS: tex:t toc:nil
#+INCLUDE: ./setup/theme.setup.org
------

Today, I hade a mini panic. I was trying to move my data from internal to external HDD using rsync. I have mounted the external HDD to a mount point and I have a soft link in the home folder for easy access. I started rsync while the external HDD was unmounted. All the data got synced somewhere on the boot drive (which is very small) until it got full. And there was no space left. But I had no idea where in the boot drive the files got synced. So now, I have a boot drive which is full with useless data somewhere which might crash my system. Luckily, after a while, the space in boot drive got cleared and I was back to where I was before this shinanigans. I have no clue what happened. But everything looks good now. Praise be thy GNU/Linux.

#+BEGIN_EXPORT html
 <div style="width:100%;height:0;padding-bottom:56%;position:relative;"><iframe src="https://giphy.com/embed/ENcROyB1aZIk4KchRS" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/nfl-fly-slide-chicago-bears-ENcROyB1aZIk4KchRS">via GIPHY</a></p>
#+END_EXPORT

#+INCLUDE: ./setup/footer.setup.org
