a-mini-panic.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>A Mini Panic</title>
<meta name="generator" content="Org mode">
<meta name="description" content="A small panic I had when I moved large files to my server's internal storage and I thought my server is going to die."
>
<link rel='stylesheet' href='./css/code.css' />
<link rel='stylesheet' href='./css/simple.css' />
<link rel='shortcut icon' href='./img/favicon.ico' type='image/x-icon' />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/fork-awesome@1.2.0/css/fork-awesome.min.css' integrity='sha256-XoaMnoYC5TH6/+ihMEnospgm0J1PM/nioxbOUdnM8HY=' crossorigin='anonymous'>
</head>
<body>
<header id="top" class="status">
<a href="./index.html">shrirambo</a>.<a href="https://github.com/shrirambo">github</a>.<a href="">io</a>/<a href="./index.html">home</a>/<a href="./index.html">blog</a>
</header>
<main id="content">
<h1 class="title">A Mini Panic</h1>
<hr>

<p>
Today, I hade a mini panic. I was trying to move my data from internal to external HDD using rsync. I have mounted the external HDD to a mount point and I have a soft link in the home folder for easy access. I started rsync while the external HDD was unmounted. All the data got synced somewhere on the boot drive (which is very small) until it got full. And there was no space left. But I had no idea where in the boot drive the files got synced. So now, I have a boot drive which is full with useless data somewhere which might crash my system. Luckily, after a while, the space in boot drive got cleared and I was back to where I was before this shinanigans. I have no clue what happened. But everything looks good now. Praise be thy GNU/Linux.
</p>

<div style="width:100%;height:0;padding-bottom:56%;position:relative;"><iframe src="https://giphy.com/embed/ENcROyB1aZIk4KchRS" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/nfl-fly-slide-chicago-bears-ENcROyB1aZIk4KchRS">via GIPHY</a></p>
</main>
<footer id="postamble" class="status">
<hr>
<section>
<script src="https://giscus.app/client.js" 
  data-repo="ShriRambo/giscus-comments"
  data-repo-id="R_kgDOG1mtrQ"
  data-category="Announcements" 
  data-category-id="DIC_kwDOG1mtrc4CBJNW" 
  data-mapping="title" 
  data-reactions-enabled="1" 
  data-emit-metadata="0" 
  data-input-position="top" 
  data-theme="dark" 
  data-lang="en" 
  crossorigin="anonymous" 
  async> </script>
</section>
<hr>
<section>
  <p style="text-align:center">
Made with ❤️ and Emacs (Org-mode)
</p>
<div align=center>
  <a href="#" class='link-icon'>
    <i class="fa fa-home fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://www.instagram.com/shrirambo/" class='link-icon'>
    <i class="fa fa-instagram fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://github.com/shrirambo" class='link-icon'>
    <i class="fa fa-github fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://www.linkedin.com/in/shriram-ashirgade/' class='link-icon'>
    <i class="fa fa-linkedin-square fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://social.vivaldi.net/@shrirambo'>
    <i class="fa fa-mastodon fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://github.com/ShriRambo/sturdy-octo-winner/tree/master/content' class='link-icon'>
    <i class="fa fa-code  fa-lg" aria-hidden="true"></i>
  </a>
  <a href='#content' class='link-icon'>
    <i class="fa fa-hand-o-up  fa-lg" aria-hidden="true"></i>
  </a>
</div>
</div>
</footer>
</body>
</html>
